const Discord = require("discord.js");
const client = new Discord.Client();// تم اصنع من اقبل : @⚔♚☛〖T̷u̷r̷k̷i̷  P̷a̷s̷h̷a̷  】☜♚⚓#8849 
var prefix = "#";

client.on('message', fkk => {
    if (fkk.content == "#كوره") {
        var x = ["المتاح للجميع لا يتاح لي",
"عقدت بطولة كأس الأمم الأفريقية الثالثة والعشرون",
"حارس المرمى الوحيد الذي شارك فى 5 نهائيات لكأس العالم لكرة القدم هو",
"أول نهائي لكأس أفريقية تحت الثلوج دار سنة 1988 ف في",
"أول بلد طبق الطريقة الدفاعية فى كرة القدم الكاتناشيو هو",
"أحرزت الكاميرون بطولة أفريقيا للأمم حتى سنة 2002 ف",
"تأهل منتخب الكويت لكرة اليد لكأس العالم حتى سنة 2002 ف",
"أقيم أول سباق للسيارات سنة 1894 ف فى",
"8 Cool عدد حكام الساحة فى كرة اليد",
"فاز بكأس آسيا عام 2000 فى بيروت",
"اسكوبار هو الحارس الذى سجل خطأ فى مرمى فريقه فى",
"تأسس الاتحاد الدولى لكرة القدم سنة",
"المجر هو أول منتخب هزم انكلترا فى ويمبلى فى منديال",
"أول منتخب يفوز بكأس العالم خارج قارته هو",
"كرايتان الألمانى حكم مباراة الدور الربع النهائى بين انكلترا والبرازيل عام",
"رقم دورة كأس العالم لكرة القدم 2002 ف هو",
"الاسكواش رياضة نشأة فى السجون",
"شاركت جنوب أفريقيا لأول مرة فى كأس أفريقيا بعد رفع الحظر عنها سنة",
"اسم حارس مرمى كوستاريكا فى منديال 1990 ف هو",
"تأسس الاتحاد الإنجليزي لكرة القدم سنة",
"المنتخب صاحب المركز 17 فى منديال 1998 ف هو",
"شاركت نيوزلندا المرة الوحيدة فى نهائيات كأس العالم سنة",
"فى منديال 1982 ف ارتفع عدد المنتخبات إلى",
"حكم واحد يكون فى مباراة كرة",
"جان فانسان هو مدرب الكامرون فى منديال",
"عدد المباريات التى خاضها ماتيوس فى منديال 1982 هو",
"عدد المشاهدين الذين حضروا كأس العالم عام 1950 ف هو",
"مارسيليا مدينة فرنسية أجريت نصف نهائى بين إيطاليا والبرازيل عام",
"عدد الأهداف التى سجلها الألمانى ريدله فى منديال 1994 ف هو",
"انجلترا هو المنتخب الوحيد الذى لم يخسر أمام البـرازيل فى منديـال",
"عدد الأهداف التى سجلت فى مرمى البرازيل فى منديال 1994 ف",
"السويد هو المنتخب الذى ألحق الخسارة الأولى لإيطاليا فى نهائيات كأس العالم وكان ذلك عام",
"عدد مباريات بطولة كأس العالم لكرة القدم 2002 هو",
"تأسس الاتحاد الألمانى لكرة القددم سنة",
"الاعب البرتغالى الذى يحمل اسم عائلة فرنسية هو",
"عدد الفرق المشاركة فى بطولة كأس العالم لكرة القدم 2002 ف هو",
"يتألف فريق الهاند بول من",
"عدد الأهداف التى سجلها بكتياور فى منديال 1966 ف",
"أدركت أسبانيا الدور النصف النهائي لكأس العالم مرة واحدة سنة",
"سرقت كأس العالم قبل أن يعثر عليها كلب مدرب سنة",
];
        var x2 = ['',
		"2002",
        "أنطونيو كاربخال",
		"قسطنتينه",
		"ايطاليا",
		"4 مرات",
		"4 مرات",
		"فرنسا",
		"اثنان",
		"اليابان",
		"1994",
		"1904",
		"1953",
		"البرازيل",
		"1966",
		"17",
		"البريطانية",
		"1996",
		"كوينخو",
		"1863",
		"أسبانيا",
		"1982",
		"24",
		"الطائرة",
		"1982",
		"2",
		"199954",
		"1938",
		"1",
		"1958",
		"3",
		"1950",
		"64",
		"1900",
		"بوتى",
		"32",
		"11",
		"4",
		"1950",
		"1966",
		
        
        
        
        ];
        
        var x3 = Math.floor(Math.random()*x.length)
        fkk.channel.send(`╔════════【۩ :soccer: :trophy:  ***__ يلا كوره __*** :trophy: :soccer:  ۩】════════╗
 
***${x[x3]}***

=====================================

**__لديك 15 ثانية للاجابة __**
╚════════════════════════════════════╝`).then(msg1=> {
            var r = fkk.channel.awaitMessages(msg => msg.content == x2[x3], {
                maxMatches : 1,
                time : 15000,
                errors : ['https://cdn.discordapp.com/attachments/429330153735454722/430040652542246912/bbcb4aa9853bf1d2.png']
            })
        r.catch(() => {
            return fkk.channel.send(`:negative_squared_cross_mark: لقد انتهى الوقت ولم يقم أحد بالأجابة بشكل صحيح 
            الإجآبة الصحيحةة هي __**${x2[x3]}**__`)
        })
        
        r.then((collected)=> {
            fkk.channel.send(`${collected.first().author} :soccer: ** اجابه صحيح معلم كوره ** :soccer: `);
        })
        })
    }
})


// تم اصنع من اقبل : @⚔♚☛〖T̷u̷r̷k̷i̷  P̷a̷s̷h̷a̷  】☜♚⚓#8849 
client.login(process.env.BOT_TOKEN);// لا تغير فيها شيء